IDEA StatiCa Open Model
ConcreteBlockData.Origin Property
Compatible with IDEA StatiCa Beta 21.0 - beta
 Origin of the concrete block LCS
 Namespace: IdeaRS.OpenModel.Connection
 Assembly: IdeaRS.OpenModel (in IdeaRS.OpenModel.dll) Version: 20.0.1.1 (20.0.1.1)
Syntax
public Point3D Origin { get; set; }
Public Property Origin As Point3D
	Get
	Set
public:
property Point3D^ Origin {
	Point3D^ get ();
	void set (Point3D^ value);
}
Property Value
Type: Point3D
See Also
Reference
ConcreteBlockData Class
IdeaRS.OpenModel.Connection Namespace